security/sec-iride/src/main/resources/iride/soap/request/findRuoliForPersonaInUseCase.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:int="http://interfaces.policy.iride2.csi.it">
    <soapenv:Header />
    <soapenv:Body>
        <int:findRuoliForPersonaInUseCase soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <in0 xsi:type="urn:Identita" xmlns:urn="urn:PolicyEnforcerBase">
                <codFiscale xsi:type="xsd:string">${irideIdentity.codFiscale}</codFiscale>
                <nome xsi:type="xsd:string">${irideIdentity.nome}</nome>
                <cognome xsi:type="xsd:string">${irideIdentity.cognome}</cognome>
                <idProvider xsi:type="xsd:string">${irideIdentity.idProvider}</idProvider>
                <timestamp xsi:type="xsd:string">${irideIdentity.timestamp}</timestamp>
                <livelloAutenticazione xsi:type="xsd:int">${irideIdentity.livelloAutenticazione}</livelloAutenticazione>
                <mac xsi:type="xsd:string">${irideIdentity.mac}</mac>
                <rappresentazioneInterna xsi:type="xsd:string">${irideIdentity.toInternalRepresentation()}</rappresentazioneInterna>
            </in0>
            <in1 xsi:type="urn:UseCase" xmlns:urn="urn:PolicyEnforcerBase">
                <appId xsi:type="urn:Application">
                    <id xsi:type="xsd:string">${useCase.appId.id}</id>
                </appId>
                <id xsi:type="xsd:string">${useCase.id}</id>
            </in1>
        </int:findRuoliForPersonaInUseCase>
    </soapenv:Body>
</soapenv:Envelope>
